src/InformationRegisters/PrintedFormTemplates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>PrintedFormTemplates</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Template</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Use</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>DesignName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Object</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/FileDoubleClickActions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>FileDoubleClickActions</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>OpenFile</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OpenCard</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Files.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Files</Name>
			<Comment>Files in folders</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Comment>Author - User, who added the file</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FileFolders</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Comment>Date of adding file to the database</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encrypted</Name>
					<Comment>Encrypted</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureIndex</Name>
					<Comment>Index of an icon, corresponding to the file extension, to be displayed in the list</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Comment>File description</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Signed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Comment>Full description (of length of up to 256 chars)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LockedBy</Name>
					<Comment>User, locked file for edit</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextStorage</Name>
					<Comment>Text, extracted from file - for full-text search</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersion</Name>
					<Comment>Active version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionAuthor</Name>
					<Comment>Author - User, who created the version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionDateCreated</Name>
					<Comment>Version create date</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVersionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionFilePath</Name>
					<Comment>Additional path to a file on drive (in case if FileStorageType - "on drive")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionSize</Name>
					<Comment>Size of versions' file</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionExtension</Name>
					<Comment>Version file extension</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVolume</Name>
					<Comment>Ref to volume (if FileStorageType = 'on drive' )</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileStorageVolumes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StoreVersions</Name>
					<Comment>Store versions - if False, file always has single Active version</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalDataAndAttributes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalDataAndAttributes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EncryptionCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Imprint</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonForms/PersonalSettings/Ext/Form/Module.bsl
&AtClient
Procedure WriteAndClose(Command)
	StructuresArray = New Array;
	
	// Work with files
	Item = New Structure;
	Item.Insert("Object", 	"FilesOpenSettings");
	Item.Insert("Options", 	"OnDoubleClickAction");
	Item.Insert("Value", 	OnDoubleClickAction);
	StructuresArray.Add(Item);
	
	Item = New Structure;
	Item.Insert("Object", 	"FilesOpenSettings");
	Item.Insert("Options", 	"AskEditModeOnFileOpening");
	Item.Insert("Value", 	AskEditModeOnFileOpening);
	StructuresArray.Add(Item);
	
	Item = New Structure;
	Item.Insert("Object", 	"ProgrammeSettings");
	Item.Insert("Options", 	"ShowTipsOnEditFiles");
	Item.Insert("Value", 	ShowTipsOnEditFiles);
	StructuresArray.Add(Item);
	
	Item = New Structure;
	Item.Insert("Object", 	"ProgrammeSettings");
	Item.Insert("Options", 	"ShowLockedFilesOnExit");
	Item.Insert("Value", 	ShowLockedFilesOnExit);
	StructuresArray.Add(Item);
	
	Item = New Structure;
	Item.Insert("Object", 	"FilesComparisonSettings");
	Item.Insert("Options", 	"FileVersionsCompareMethod");
	Item.Insert("Value", 	FileVersionsCompareMethod);
	StructuresArray.Add(Item);
	
	Item = New Structure;
	Item.Insert("Object", 	"ProgrammeSettings");
	Item.Insert("Options", 	"ShowColumnSize");
	Item.Insert("Value", 	ShowColumnSize);
	StructuresArray.Add(Item);
	
	CommonUse.CommonSettingsStorageSaveArray(StructuresArray);
	Close();
	
	RefreshReusableValues();
EndProcedure

&AtClient
Procedure WorkingDirectorySetting(Command)
	OpenFormModal("CommonForm.LocalFileCacheSettings");
EndProcedure

&AtClient
Procedure InstallFileOperationsExtensionAtClient(Command)
	InstallFileSystemExtension();
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancellation, StandardProcessing)
	
	// work with users
	AuthorizedUser = Users.AuthorizedUser();
	
	// Work with files
	AskEditModeOnFileOpening = 
		CommonSettingsStorage.Load("FilesOpenSettings", "AskEditModeOnFileOpening");
	If AskEditModeOnFileOpening = Undefined Then
		AskEditModeOnFileOpening = True;
		CommonSettingsStorage.Save("FilesOpenSettings", "AskEditModeOnFileOpening", AskEditModeOnFileOpening);
	EndIf;
	
	OnDoubleClickAction = CommonSettingsStorage.Load("FilesOpenSettings", "OnDoubleClickAction");
	If OnDoubleClickAction = Undefined Then
		OnDoubleClickAction = Enums.FileDoubleClickActions.OpenFile;
		CommonSettingsStorage.Save("FilesOpenSettings", "OnDoubleClickAction", OnDoubleClickAction);
	EndIf;
	
	FileVersionsCompareMethod = CommonSettingsStorage.Load("FilesComparisonSettings", "FileVersionsCompareMethod");
	ShowTipsOnEditFiles = CommonUse.CommonSettingsStorageLoad("ProgrammeSettings", "ShowTipsOnEditFiles");
	
	ShowLockedFilesOnExit = CommonUse.CommonSettingsStorageLoad("ProgrammeSettings", "ShowLockedFilesOnExit");
	If ShowLockedFilesOnExit = Undefined Then 
		ShowLockedFilesOnExit = True;
		CommonSettingsStorage.Save("ProgrammeSettings", "ShowLockedFilesOnExit", ShowLockedFilesOnExit);
	EndIf;	
	
	ShowColumnSize = CommonSettingsStorage.Load("ProgrammeSettings", "ShowColumnSize");
	If ShowColumnSize = Undefined Then
		ShowColumnSize = False;
		CommonSettingsStorage.Save("ProgrammeSettings", "ShowColumnSize", ShowColumnSize);
	EndIf;
	
	// work with documents
	InternalDocumentKind 	= CommonSettingsStorage.Load("SettingsOfWorkWithDocuments", "InternalDocumentKind");
	IncomingDocumentKind	= CommonSettingsStorage.Load("SettingsOfWorkWithDocuments", "IncomingDocumentKind");
	OutgoingDocumentKind 	= CommonSettingsStorage.Load("SettingsOfWorkWithDocuments", "OutgoingDocumentKind");
	
	SendMethod  	= CommonSettingsStorage.Load("SettingsOfWorkWithDocuments", "SendMethod");
	ObtainingMethod = CommonSettingsStorage.Load("SettingsOfWorkWithDocuments", "ObtainingMethod");
	
	ShowWarningOnRegistration = CommonSettingsStorage.Load("SettingsOfWorkWithDocuments", "ShowWarningOnRegistration");
	If ShowWarningOnRegistration = Undefined Then 
		ShowWarningOnRegistration = True;
		CommonSettingsStorage.Save("SettingsOfWorkWithDocuments", "ShowWarningOnRegistration", ShowWarningOnRegistration);
	EndIf;	
	
	If Parameters.Property("ThisIsWebClient") Then 
		If Not Parameters.ThisIsWebClient Then
			Items.InstallFileOperationsExtensionAtClient.Visible = False;
		EndIf;		
	EndIf;
EndProcedure

&AtClient
Procedure ScanningSetup(Command)
	ComponentInstalled = WorkWithScannerClient.InitializeComponent();
	
	SystemInfo 	= New SystemInfo();
	ClientID 	= SystemInfo.ClientID;
	
	FormParameters = New Structure("ComponentInstalled, ClientID", 
		ComponentInstalled, ClientID);
	OpenFormModal("Catalog.Files.Form.ScanningSetup", FormParameters);
EndProcedure

&AtClient
Procedure WorkingDirectorySettingForPrinting(Command)
	OpenForm("InformationRegister.PrintedFormTemplates.Form.PrintFilesFolderSettings");
EndProcedure

&AtClient
Procedure UserInfo(Command)
	
	OpenValue(AuthorizedUser);
	
EndProcedure

&AtClient
Procedure SetActionOnPrintFormTemplateSelect(Command)
	OpenForm("InformationRegister.PrintedFormTemplates.Form.ChoiceOfTemplateOpenMode");
EndProcedure

&AtClient
Procedure PersonalSettingsProxyServer(Command)
	
	OpenForm("CommonForm.ProxyServerParameters",
					New Structure("SettingProxyAtClient", True));
	
EndProcedure
